## Basic Concatenation

In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city":['Chennai','bangalore','Delhi'],
    "temperature":[32,45,40],
    "humidity":[80,90,78]
})

In [3]:
india_weather

        city  temperature  humidity
0    Chennai           32        80
1  bangalore           45        90
2      Delhi           40        78

In [4]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
df = pd.concat([india_weather,us_weather],ignore_index=True)

In [7]:
df

        city  temperature  humidity
0    Chennai           32        80
1  bangalore           45        90
2      Delhi           40        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

## Concatenation and Keys

In [8]:
df = pd.concat([india_weather,us_weather],keys=['india','us'])

In [9]:
df

              city  temperature  humidity
india 0    Chennai           32        80
      1  bangalore           45        90
      2      Delhi           40        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [10]:
df.loc['india']

        city  temperature  humidity
0    Chennai           32        80
1  bangalore           45        90
2      Delhi           40        78

In [11]:
df.loc['us']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## Concatenation using Keys

In [12]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [13]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
},index=[1,0] )
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [14]:
df = pd.concat([temperature_df,windspeed_df],axis = 1)

In [15]:
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [16]:
df = pd.concat([temperature_df,windspeed_df],axis=1,join="inner")

In [17]:
df

     city  temperature    city  windspeed
0  mumbai           32  mumbai         12
1   delhi           45   delhi          7

## Concatenate dataframe with series

In [19]:
s = pd.Series(["Humid","Dry","Rain"],name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [20]:
pd.concat([temperature_df,s],axis=1)

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

In [21]:
df

     city  temperature    city  windspeed
0  mumbai           32  mumbai         12
1   delhi           45   delhi          7

In [22]:
df2 = india_weather.append(us_weather,ignore_index=True)

In [23]:
df2

        city  temperature  humidity
0    Chennai           32        80
1  bangalore           45        90
2      Delhi           40        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [24]:
tn_weather = pd.DataFrame({
    "city": ["Chennai","Coimbatore","Madurai"],
    "temperature": [21,14,35],
    "rainfall": [60, 165, 75]
})

In [25]:
df2.append(tn_weather,ignore_index=True)

         city  temperature  humidity  rainfall
0     Chennai           32      80.0       NaN
1   bangalore           45      90.0       NaN
2       Delhi           40      78.0       NaN
3    new york           21      68.0       NaN
4     chicago           14      65.0       NaN
5     orlando           35      75.0       NaN
6     Chennai           21       NaN      60.0
7  Coimbatore           14       NaN     165.0
8     Madurai           35       NaN      75.0